<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"7e6bc680db4742802453fef3dbe5118b72cdaee8d1b21254a333433d28a97321","plan_job_ref":"Job plan #18 at https://github.com/GSA/usnotify-ssb/actions/runs/4928160572","plan_hash":"1700763fc83c387d846d19b7dbfea777e159af9b39de90ca5ed55cceb786a8c9","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 4 to add, 1 to change, 4 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_kms_alias.zone[0] must be replaced
-/+ resource "aws_kms_alias" "zone" {
      ~ arn            = "arn:aws:kms:us-east-1:937586814688:alias/DNSSEC-notify-staging" -> (known after apply)
      ~ id             = "***************************" -> (known after apply)
      ~ name           = "alias/DNSSEC-notify-staging" -> "alias/DNSSEC-ssb" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "***************************************************************************" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route53_hosted_zone_dnssec.zone[0] must be replaced
-/+ resource "aws_route53_hosted_zone_dnssec" "zone" {
      ~ hosted_zone_id = "Z05030681KQNUTE9KP80P" # forces replacement -> (known after apply) # forces replacement
      ~ id             = "*********************" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route53_key_signing_key.zone[0] must be replaced
-/+ resource "aws_route53_key_signing_key" "zone" {
      ~ digest_algorithm_mnemonic  = "SHA-256" -> (known after apply)
      ~ digest_algorithm_type      = 2 -> (known after apply)
      ~ digest_value               = "B8E712CEDB016A8928F2C7647A11BDAD7BF32B30E1E415C89EA497840ECB883F" -> (known after apply)
      ~ dnskey_record              = "257 3 13 X58+Mr8yYRrPJpblR/DAVbakp8eeP66H1H1iKz5rgtwnTbGwGN/osf8AxYRvYcgBTI+VezqhEiVIAp3W78pGFQ==" -> (known after apply)
      ~ ds_record                  = "62629 13 2 B8E712CEDB016A8928F2C7647A11BDAD7BF32B30E1E415C89EA497840ECB883F" -> (known after apply)
      ~ flag                       = 257 -> (known after apply)
      ~ hosted_zone_id             = "Z05030681KQNUTE9KP80P" # forces replacement -> (known after apply) # forces replacement
      ~ id                         = "*************************************************" -> (known after apply)
      ~ key_tag                    = 62629 -> (known after apply)
      ~ name                       = "notify-staging.rcahearn.net" -> "ssb.notify.gov" # forces replacement
      ~ public_key                 = "****************************************************************************************" -> (known after apply)
      ~ signing_algorithm_mnemonic = "ECDSAP256SHA256" -> (known after apply)
      ~ signing_algorithm_type     = 13 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_route53_zone.zone[0] must be replaced
-/+ resource "aws_route53_zone" "zone" {
      ~ arn           = "arn:aws:route53:::hostedzone/Z05030681KQNUTE9KP80P" -> (known after apply)
      ~ id            = "*********************" -> (known after apply)
      ~ name          = "notify-staging.rcahearn.net" -> "ssb.notify.gov" # forces replacement
      ~ name_servers  = [
          - "ns-1132.awsdns-13.org",
          - "ns-1868.awsdns-41.co.uk",
          - "ns-211.awsdns-26.com",
          - "ns-570.awsdns-07.net",
        ] -> (known after apply)
      - tags          = {} -> null
      ~ tags_all      = {} -> (known after apply)
      ~ zone_id       = "*********************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment                     = (sensitive value)
        id                              = "eed9328b-688a-4196-86e0-90d089274179"
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "ssb-smtp"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ ds_record     = [
        "DS",
      - "notify-staging.rcahearn.net",
      - "62629 13 2 B8E712CEDB016A8928F2C7647A11BDAD7BF32B30E1E415C89EA497840ECB883F",
      + "ssb.notify.gov",
      + (known after apply),
    ]
  ~ instructions  = "Create NS and DS records in the .rcahearn.net zone with the values indicated." -> "Create NS and DS records in the .notify.gov zone with the values indicated."
  ~ ns_record     = [
        "NS",
      - "notify-staging.rcahearn.net",
      - jsonencode(
            [
              - "ns-1132.awsdns-13.org",
              - "ns-1868.awsdns-41.co.uk",
              - "ns-211.awsdns-26.com",
              - "ns-570.awsdns-07.net",
            ]
        ),
      + "ssb.notify.gov",
      + (known after apply),
    ]
```
</details>

:white_check_mark: Plan applied in [apply #19](https://github.com/GSA/usnotify-ssb/actions/runs/4937636421)